{
  "title": "仕事の進め方全般",
  "closed": false,
  "archived": false,
  "created_at": "2025-01-09",
  "comments": [
    {
      "author": "eggc",
      "created_at": "2025-01-09",
      "body_markdown": "困る依頼の例 | なぜ困るか\n-- | --\nandroid のテストをしたいから携帯貸してください | 個人情報が詰まったものを渡したくない。\nエディタは VSCode を使ってください | ずっと慣れたエディタを使いたいのに、なぜ切り替える必要があるのか腑に落ちない。\n（プロダクトを利用している現場のスタッフから）絶対にこの方が良いので、仕様変更してください | 技術的には可能でも開発者には権限がない。プロダクトオーナーに依頼して欲しい。\n（全く知らないプロジェクトで）コードレビューしてください | 時間かかるし良い指摘ができない。\n\n## 対応1: すぐやる\n\n数分で終わるような依頼は、さっさとやってしまった方が、コミュニケーションコストが少なくて済む。レビューとかは時間を作れば、何かしらのレスポンスはできるのでこれに該当する。ただ、仕様変更は損失が発生するリスクがあり、無断で実行した場合は重い責任が発生するので、やるべきでない。\n\n## 対応2: 後でやる\n\nTODO リストに追加して、暇な時にやる。おそらく暇な時は訪れないので、ひたすら延期される。実際にはやらない。\n\n## 対応3: 無視する\n\nステークホルダーでない人からの依頼の場合は、それを進めなかったところで致命傷にはならないことが多い。なので、一旦放置する。本当に困っているなら、もう一度同じ依頼が来る。このようにして依頼を選別する。依頼者からの印象は悪くなるし、解決するべき課題を見逃してしまう恐れもある。\n\n## 対応4: 断る\n\n依頼に対して断る。感情をぶつけて「いやです」とか「なんで？」みたいなことを言わずに、丁寧に返事をするようにした方がいい。返事を待たないで、会話を終わりにする。これで頭に情報が残らないので次の仕事に集中できる。\n\n困る依頼の例 | 断り方の例\n-- | --\nandroid のテストをしたいから携帯貸してください | ごめんなさい、個人の所有物なので無理です。会社の備品を使ってください。会社の備品がなければ申請しましょう。備品が届くまでは、エミュレーター等でテストしてください。\nエディタは VSCode を使ってください | 情報共有ができて便利そうですが、私はどうしても使い慣れているエディタがあるのでご容赦ください。エディタ周りのトラブルがあっても自己責任でやりますし、サポートなしで構いません。\n（プロダクトを利用している現場のスタッフから）絶対にこの方が良いので、仕様変更してください | 私では判断できないのでプロダクトオーナーの＊＊さんの窓口に繋ぎますね。あとは彼と話してください。\n（全く知らないプロジェクトで）コードレビューしてください | 済みませんが、十分な調査時間が取れず、良い指摘ができそうもないので、辞退しますね。\n\nもちろん、相手によっては、依頼内容を譲歩して再提案してきたり、依頼背景を補足してきたりする。それは別の依頼として、もう一度考えてみれば良い。",
      "body_updated_at": "2025-01-09"
    },
    {
      "author": "eggc",
      "created_at": "2025-01-10",
      "body_markdown": "両論併記すると立場が中立で誠実そうにみえるけど、自分の意志を乗せた文章になりにくい。両論併記しないほうが、自分の意に沿った結果になることがある。\n\nかっこ書きで余分な情報を足すのも、意見が前後して不安定な印象を与えるので、消した方が良い。\n\n- ❌ CIはあらゆるプロジェクトで導入するべきです（そうはいってもすぐ導入は難しいので、現場で話し合いながらやるべきですが）\n\n",
      "body_updated_at": "2025-01-14"
    },
    {
      "author": "eggc",
      "created_at": "2025-01-14",
      "body_markdown": "何か問題があったとしても、小言・不平・文句・晒しはせずに、改善依頼・提案と言う形に持っていってもらうのが良い。人を責めるのではなくて、組織やルールに対する意見を出す。\n\n苛立ちを態度に出すと、相手のストレスを増やすので、組織全体のストレスは減らない。\n",
      "body_updated_at": "2025-01-14"
    },
    {
      "author": "eggc",
      "created_at": "2025-01-14",
      "body_markdown": "* テストの7原則\n* スモークテスト：開発者が作った新機能を確認するためのテスト。煙が出ないか確認する。\n* 組み合わせ表：入力・出力の組み合わせを表にしたもの。\n* ペアワイズ法：1~2要素の組み合わせでテストする。70%~97%のバグを見つけられるらしい。",
      "body_updated_at": "2025-01-14"
    },
    {
      "author": "eggc",
      "created_at": "2025-01-14",
      "body_markdown": "なんでも質問してください、と言うマインドを伝えるのは大事。ただ、スコープを絞ってからの方が良い。例えば入社してすぐに出会い頭「なんでも質問してください」は疑問探しから始まるので、質問しづらい。勤怠申請手続きの説明をしてから「ここまでの話で、なんでも質問してください」は質問しやすい。\n",
      "body_updated_at": "2025-01-14"
    }
  ]
}